#pragma once

_MITC_BASIC_BEGIN
//global.h

//=========================================================================//
//    功  能：获取当前应用程序的路径目录                                   //
//    参  数：无                                                           //
//    返回值：当前应用程序的路径目录                                       //
//    备  注：无                                                           //
//=========================================================================//
CString GetCurrentPath();

//=========================================================================//
//    功  能：检查给定目录是否存在，如果不存在则创建该目录                 //
//    参  数：sDirectory，给定路径                                         //
//    返回值：无                                                           //
//    备  注：无                                                           //
//=========================================================================//
void CheckDirectory(CString sDirectory);

//=========================================================================//
//    功  能：返回错误信息                                                 //
//    参  数：Error，错误码                                                //
//    返回值：错误信息                                                     //
//    备  注：无                                                           //
//=========================================================================//
CString FormartLastError(DWORD Error);

//=========================================================================//
//    功  能：检查目录是否存在，不存在则创建此路径，C:a                  //
//    参  数：lpszDirectory，目录路径                                      //
//    返回值：TRUE,FALSE                                                   //
//    备  注：无                                                           //
//=========================================================================//
BOOL CheckDirectory(LPCTSTR lpszDirectory);

//=========================================================================//
//    功  能：创建UNICODE格式的文件，以0xfeff开头                          //
//    参  数：strPathFile,文件路径                                         //
//    返回值：HANDLE，文件句柄                                             //
//    备  注：无                                                           //
//=========================================================================//
HANDLE CreateUnicodeFile(CStringW strPathFile);

//=========================================================================//
//    功  能：写UNICODE格式的日志文件，存放与当前应用程序路径下的log文件夹 //
//            下文件名为：log_年-月-日.txt                                 //
//    参  数：sLogMsg,日志信息                                             //
//    返回值：TRUE,FALSE                                                   //
//    备  注：无                                                           //
//=========================================================================//
BOOL WriteLogFile(CStringW sLogMsg);
////////////////////////////////////////////////////////////////////////////////////

_MITC_BASIC_END